Revit 2025 API
CurtainGridAlignType Enumeration
An enumerated to list CurtainGrid patterns.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum CurtainGridAlignType
Public Enumeration CurtainGridAlignType
public enum class CurtainGridAlignType
type CurtainGridAlignType
Members
Member name | Value | Description
NoJustify | 0 |  NoJustify.
Beginning | 1 |  Beginning pattern of CurtainGrid.
Center | 2 |  Center pattern of CurtainGrid.
End | 3 |  End pattern of CurtainGrid.
See Also
Reference
Autodesk.Revit.DB Namespace